package com.example.administrator.shixun.Send;

import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.widget.ImageView;
import android.widget.TextView;

import com.example.administrator.shixun.R;

import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.Random;

public class PinxiangActivity extends AppCompatActivity {
    private String ming;
    private String biao;
    private int tupian;
    private TextView biaoa;
    private TextView shijian;
    private ImageView pic;
    private TextView bibibia;
    private TextView tv;
    private int[] imageidd={R.drawable.m1,R.drawable.m2,R.drawable.m3,R.drawable.m4,R.drawable.m5,R.drawable.m6,R.drawable.m7,R.drawable.m8,R.drawable.m9,R.drawable.m10,R.drawable.m11,R.drawable.m12,R.drawable.m13,R.drawable.m14,R.drawable.m15,R.drawable.m16,R.drawable.m17,R.drawable.m18};
    private String [] bibibi={"“家家户户剥春笋，白菜青盐糙米饭，瓦壶天水菊花茶”，郑板桥对美食如此推崇，今天我们提起的美食，要和家人朋友一起分享才是最好的，它芬芳的美味和美丽的颜色，更加的诱惑人心，如此让人喜欢的美味佳肴，我不会错过，假如你喜欢这样的美食，就和朋友、家人一起去尝尝吧。","几种令人流口水的美味，吃货们不要错过！。“家家户户剥春笋，白菜青盐糙米饭，瓦壶天水菊花茶”，郑板桥对美食如此推崇，这道美味的佳肴看到让人垂涎三尺，尝一口更是胃口大开，鲜美的食物营养丰富，味道鲜美，可以说色香味俱全，健康又有营养，而且还能让人心情愉悦，我这样的吃货一定不会错过，营养十足，美味又很健康，作为一个吃货，我非常的喜欢。","每个城市有不同的街景，不同的美食，不同的文化，不过作用确实相同的，同样的诱人，美味的食物让我回味无穷，回味起来又让人垂涎欲滴，要么就是和吃货们一起享受这样的美食，能和你们一起分享这些美食，实在是莫大的荣幸，爱上美食的吃货，是上天赐予的幸福，要好好把握哦。","关于美食，有这样一句话，人世间，唯有爱与美食不可辜负，爱已经辜负的太多了，美食就不能再辜负了,分享给你这个菜,我吃过很多次，每次都有新鲜感,简直太好吃了,真心推荐给你，如果你看饿了就赶紧去吃吧，别饿到自己","吃食是一种幸福，品味是一种情趣，美味的食物让我回味无穷，回味起来又让人垂涎欲滴，十足的营养充分满足我们生活的需求，但是又十分的美味，如此让人喜欢的美味佳肴，我不会错过，况且这样的没事营养十足，而且还十分的美味，不要错过哦。","老人总是站在街的拐角，专心致致地油炸臭豆腐。从没有听过他的吆喝声但总有许多食客寻着香味而来，在他的小担子前站成一圈。他的臭豆腐很有特色，\n" +
            "                    乍看上去黑不溜湫，和别的臭豆腐没有什么两样，但一入锅再一出锅，就变得金灿灿、香喷喷，\n" +
            "     涂上一层酱油或辣椒酱(他的辣椒酱是自制的，红艳艳的，辣得香，辣得舒服)，黄黄红红，煞是好看。小心翼翼咬上一口(因为非常烫)，外黄内白，外酥内嫩，香辣刺激，此时已不是在吃而是舌头打着卷往下吞。","世界上的美食到底有多少种，恐怕这个数字没人能统计得出来，美食和文化有着密不可分的联系，它反映了一个地方的风土人情，甚至是政治和经济状况，传统美食一直深受大众喜爱，我们日常接触最多的，莫过于区域的传统美食和家庭美食，这个范围一下子缩小了许多，但实际就是这样，一日三餐，总不能天天跑到外面去吃，这就少不了要自己亲自动手制作美食，这个过程其实也是很开心、很舒服的一件事。","食材本身有它自己的属性，我们既要保证在制作的过程中保留它独有的味道和营养成分，又要能够将它及其搭配的食材融合到一起，使它们共同作用，达到我们想要的效果，做饭很简单，但要做到色、香、味俱全，就很不简单了，这里想和大家分享一下我对于制作美食的心得，希望对正在美食道路上探索的你有所帮助。","常听人们说小笼包美味可口，我却从没尝过，也不知是啥味道。这天下午，爸爸妈妈带我来到小笼包子店让我开开眼界，饱饱口福。那天终于如愿以偿了.小笼包一个个白生生，皮薄薄的，里面好象有一包汁水在，小笼包小巧玲珑，形似宝塔，呈半透明壮，晶莹透黄，宝塔顶上一阵阵香气随风四溢，形状也和包子差不多，难怪叫小笼包。小笼包以上一般都是一笼里面有十个，每个都是圆鼓鼓的像一个个小雪球似的，只不过上面有一个凹凸不平的地方，还没上来我就被这香气熏得如痴如醉了。真恨不得把整个蒸好的小笼包一口吞掉。 一笼小笼包上来了，我坐在椅子上，刚蒸完的小笼包发出了一丝淡淡的香气息。一闻到这种香气息，我就忍不住要去大口大口的吃它了。刚夹起一个 “小胖墩”塞进嘴里，它就开始反 抗。 我这时肚子正饿得咕咕叫，恨不得将嘴巴变大，把四笼小笼包一口吞下去。于是我就用筷子小心翼翼地夹起小笼包，因为轻咬了一小口，汁水就像千军万马往我嘴里奔跑。我把它沾一点醋，轻进我的嘴里，肉馅又松又软，只要一嚼，它的肉就一下子松了下来，鲜美无比 妈妈说：“吃小笼包应该先醮点醋，轻轻咬一个洞，把里面鲜美的汤汁吸干，再吃皮和肉。小笼包的美味精华就在汤汁里。我按照妈妈的方法吃，汤汁鲜、皮薄肉嫩，真是好吃极了。果然，小笼包一会儿不吃不知道，一吃忘不了。我狼吞虎咽地吃了起来。它的肉非常十足，咬一口鲜鲜的，浓浓的，咸咸的，让你吃了还想吃。于是我又缠着妈妈去买一客，当阿姨笑盈盈端来后，我又怎能放过呢？吃了一个又一个，在吃得满口流香，砸咂嘴，不住称赞道：“美！真是美味之极。”一眨眼，又被我消灭了，摸了摸鼓鼓的小肚子，舔舔嘴，余兴未了。 怎么样，心动了？心动不如行动，去吃吃你们家乡的小笼包吧！","小的时候，一放学就往街上跑，当然，这是在口袋里有几个钱的时候。穿过小巷，翻过小桥，就可闻到油炸臭豆腐的香味。经营油炸臭豆腐的是个瘦瘦的老人，眉毛胡子全白了，他总是挑一副担子，担子其实是木头做的箱子，前面一个箱子放着臭豆腐、酱油、辣椒酱和一叠小盘子，还有一个罐头瓶，里面插着几双筷子。后面一个箱子安放着一只小煤炉和一口锅。","老人总是站在街的拐角，专心致致地油炸臭豆腐。从没有听过他的吆喝声，但总有许多食客寻着香味而来，在他的小担子前站成一圈。他的臭豆腐很有特色，乍看上去黑不溜湫，和别的臭豆腐没有什么两样，但一入锅再一出锅，就变得金灿灿、香喷喷，涂上一层酱油或辣椒酱(他的辣椒酱是自制的，红艳艳的，辣得香，辣得舒服)，黄黄红红，煞是好看。小心翼翼咬上一口(因为非常烫)，外黄内白，外酥内嫩，香辣刺激，此时已不是在吃而是舌头打着卷往下吞。","老人一次总是只炸几块，炸好几块卖几块，所以等的人都是一个吃，其他的人共同行注目礼。吃油炸臭豆腐的人大多是女人和孩子，真的很奇怪，江南女子都是不吃辣的，但一到这担子前就都变成“辣妹子”了，辣椒酱涂了厚厚的一层还要涂，女人此时也不管斯文了，直吃得嘴唇通红，涕泪交加，热汗直冒。老人只是不住地说：辣得结棍，勿要吃得格许多。说归说，他也不去阻挡。所以，老人的辣椒酱每天都要消耗一瓶。","那时，我父亲每月给我五毛钱，至少有一半的钱是贡献给臭豆腐了。一块臭豆腐一分钱，吃完一块，这一天才能安静下来。有时候没有计划好超支了，那么，我就克制住自己不往那里跑，怕自己的眼睛里会长出钩子来。不过，那样的时候，只要我不小心溜到老人的担子前，老人总会洞察一切，好象发现了我的口袋里没有半分钱，就会笑眯眯地炸一块最脆最嫩的送给我吃。不好意思白吃，等下个月父亲寄钱来的时候，我马上就去还给他，老人也收下，但必定多炸一块臭豆腐给我。","那是江南冬日的一个星期日的早晨，一向节俭的舅母突然提出带我去吃肉骨头粥。我受宠若惊，一路屁颠屁颠地紧跟在她身后，生怕她又突然改变主意。\n" +
            "沿着青石板路，穿过熙熙攘攘的菜市，拐进一条小巷。远远看见一个小铺子飘出阵阵白雾，还听到铁勺敲锅沿的声音。舅母领着我走进这间铺子，铺子里已经座无虚席。大家都在唏哩哗啦地喝这叫肉骨头粥的东西，好象这东西真的很好吃。","二十多年前，舅舅一家好象特别喜欢吃阳春面，每到星期天，舅舅就必定带领全家到镇上的面馆去吃阳春面。两个表弟兴高采烈，但我却很不喜欢。阳春面上除了撒一些葱花就没有别的了，光溜溜的，一点味道都没有，吃了第一口就不想吃第二口。每次我都没有方法把一碗阳春面吃完，我总是旁敲侧击地提醒舅舅还是吃馄饨好，至少还有点肉味。但舅舅坚决不肯，说馄饨太贵，又不经吃，同样一角钱，阳春面吃得饱饱的，而馄饨却只能塞牙缝。舅舅的牙缝好大。不喜欢吃，但每个星期天都得陪舅舅全家去吃，因为这是他们的节日，整整六天他们都在等着这一天。镇上那家面馆都认识舅舅，每次一来不用吩咐，就很快端上阳春面来，然后，舅舅一家就开始埋头苦干，并制造出幸福的声响来。每当此时，我就望着面前的阳春面愁眉苦脸。"};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_pinxiang);
        ming=this.getIntent().getStringExtra("mingzi");
        biao=this.getIntent().getStringExtra("biaoti");
        tupian=Integer.parseInt(this.getIntent().getStringExtra("tupian"));
        biaoa=findViewById(R.id.biaoa);
        tv=findViewById(R.id.tv_title);
        tv.setText(ming);
        shijian=findViewById(R.id.shijian);
        bibibia=findViewById(R.id.bibibi);
        biaoa.setText(biao);
        pic=findViewById(R.id.pic);
        pic.setImageResource(imageidd[tupian]);
        SimpleDateFormat simpleDateFormat = new SimpleDateFormat("yyyy年MM月dd日 HH:mm:ss");
        Date date = new Date(System.currentTimeMillis());
        shijian.setText("时间:"+simpleDateFormat.format(date));
        int j = new Random().nextInt(15)%(15-0+1)+0;
        bibibia.setText(bibibi[j]);
    }
}
